def checkText(text=str):
    if len(text) < 5:
        print("The string too small!")
        return ""
    else:
        print("виведіть третій символ цього рядка: ", text[2])
        print("виведіть передостанній символ цього рядка: ", text[-2])
        print("виведіть перші п'ять символів цього рядка: ", text[0:5])
        print("виведіть весь рядок, крім двох останніх символів: ", text[0:len(text) - 2])
        print("виведіть усі символи з парними індексами [0,2,4, ...]: ", text[0::2])
        print("виведіть усі символи з непарними індексами [1,3,5..]: ", text[1::2])
        print("виведіть усі символи у зворотному порядку: ", text[::-1])
        print("виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього: ",
              text[len(text):0:-2])
        print("виведіть довжину цього рядка: ", len(text))


checkText(input('Введіть рядок: '))
